Revit 2024 API
RoutingPreferenceRule Methods
The RoutingPreferenceRule type exposes the following members.
Methods
Name | Description
AddCriterion
 Adds a new routing criterion.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCriterion
 Gets the specified criteria.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
RemoveCriteron
 Removes an existing criterion.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace